tests/Functional/Resources/Prices/_fixtures/response/full_entity.json

{
  "data": {
    "id": "pri_01he6hp8cg49jjf1pdjf6d5yw1",
    "product_id": "pro_01gsz4t5hdjse780zja8vvr7jg",
    "description": "Weekly (per seat)",
    "name": "Weekly",
    "billing_cycle": {
      "interval": "year",
      "frequency": 1
    },
    "trial_period": {
      "interval": "week",
      "frequency": 1
    },
    "tax_mode": "account_setting",
    "unit_price": {
      "amount": "1000",
      "currency_code": "GBP"
    },
    "unit_price_overrides": [
      {
        "country_codes": [
          "CA",
          "US"
        ],
        "unit_price": {
          "amount": "5000",
          "currency_code": "USD"
        }
      }
    ],
    "custom_data": {
      "foo": "bar"
    },
    "status": "active",
    "quantity": {
      "minimum": 1,
      "maximum": 1
    },
    "created_at": "2023-08-16T14:38:08.3Z",
    "updated_at": "2023-08-16T14:38:08.3Z"
  },
  "meta": {
    "request_id": "c5f89594-9551-47b5-a946-6030942b6080"
  }
}
