tests/Functional/Resources/Prices/_fixtures/response/minimal_entity.json

{
  "data": {
    "id": "pri_01he6fm50df5cjmwdy3v3p1z1t",
    "product_id": "pro_01gsz4t5hdjse780zja8vvr7jg",
    "description": "Monthly (per seat)",
    "name": null,
    "billing_cycle": {
      "interval": "month",
      "frequency": 1
    },
    "trial_period": null,
    "tax_mode": "account_setting",
    "unit_price": {
      "amount": "500",
      "currency_code": "USD"
    },
    "unit_price_overrides": [],
    "custom_data": null,
    "status": "active",
    "quantity": {
      "minimum": 1,
      "maximum": 100
    },
    "created_at": "2023-08-16T14:38:08.3Z",
    "updated_at": "2023-08-16T14:38:08.3Z"
  },
  "meta": {
    "request_id": "119db08f-5a82-4993-9dfa-72ec694af98b"
  }
}
